print('--------Dictionary--------')

#ตัวอย่างการเพิ่มข้อมูล
'''
colos={
 "red":"สีแดง"
 "blue":"สีฟ้า"
}
colors["blue"]="สีน้ำเงิน"
'''
#ตัวอย่างการเข้าถึงข้อมูล = print(ตัวแปร[Key])


#ตัวอย่างการแก้ไขข้อมูล
'''
colos={
 "red":"สีแดง"
 "blue":"สีฟ้า"
}
colors["blue"]="สีคราม"
'''
#print(ตัวแปร.keys()) = เพื่อดึงข้อมูล Key มาทั้งหมด
#print(ตัวแปร.values()) = เพื่อดึงข้อมูล values มาทั้งหมด
#print(ตัวแปร.items()) = เพื่อดึงข้อมูล Key และ values มาทั้งหมด
#ตัวอย่างการใช้ for loop
'''
for i in ตัวแปร.keys():
   print(i)
เพื่อเรียกใช้ keys ทั้งหมด
เปลี่ยนเป็น values และ items ได้
'''
#===================================
'''
for keys,values in ตัวแปร.items():
   print(keys,"=",values)
'''
#ตัวแปร.pop() = เพื่อลบข้อมูลหนึ่งตัวที่เลือก
#ตัวแปร.clear() = เพื่อลบข้อมูลทั้งหมด

#ตัวอย่างการเพิ่มช้อมูลโดยใช้ฟังชั่น ใช้แก้ไขข้อมูลได้ด้วย
#ตัวแปร.update(("keys","values"))

#ฟั่งชั่นcopyเพื่อคัดลอกข้อมูล