#List
print('----1---- \n----1----')
#List->Array
a = [10,15,3.5,'ping',55,'chon']
print(a)
print(a[3]) #ใส่เลขตามด้านหลัง เพื่อเป็นการเรียกข้อมูล

print('----2---- \n----2----')
#List->Tuple
c = ('folk',4,6,8,'chon')
print(c)
# Array(แก้ไขได้) != Tuple(แก้ไขไม่ได้)

print('----3---- \n----3----')
#Lise->set
e={}
print(e)

f = {'folk',4,6,8,'chon',8,'chon'}
print(f)

print('----4---- \n----4----')
#List->Dictionary
g = {}
print(g)
k = {
    1:'non',2:'ping',3:'tee',4:'pound'
}
print(k)

print(k[2])

m = {
    'ชื่อเล่น':"โฟก",'ชื่อพ่อแม่':"อ้อย",'อายุ': 16
}
print(m['ชื่อเล่น'])

v = [{'ชื่อเล่น':"โฟก",'ลูกใคร':"แม่อ้อย",'อายุ': 16},{'ชื่อเล่น':"สายชล",'ลูกใคร':"พ่อสอง",'อายุ': 16}
     ,{'ชื่อเล่น':"มิก",'ลูกใคร':"พ่อสน",'อายุ': 16}]

print(v[0]['ชื่อเล่น'])

print("ชื่อเล่น:",v[0]['ชื่อเล่น'], "| ลูกของ:",v[0]['ลูกใคร'])